
read_verilog complex_expr.v
read_verilog -lib ../v2flib/v2f_primitives.v
hierarchy -libdir ../v2flib -check -top top
flatten
proc
opt
script ../v2flib/techmap.ys
write_json -selected ./output/complex_expr.json
show