read_verilog lut_small.v
read_verilog -lib ../v2flib/v2f_primitives.v
hierarchy -check -libdir ../v2flib -top top

#coarse
proc
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt
wreduce
peepopt
opt_clean
share
opt
memory -nomap
opt_clean

script ../v2flib/techmap.ys

#final
write_json -selected ./output/test7.json
show top