
read_verilog swizzle.v
hierarchy -libdir ../v2flib -check -top top
proc
flatten
opt
techmap -map ../yosys/techlibs/common/gate2lut.v -D LUT_WIDTH=8
write_json ./output/test6.json
show top