
read_verilog test2.v
hierarchy -check -top test2
flatten
proc
opt
techmap -map ../yosys/techlibs/common/gate2lut.v -D LUT_WIDTH=8
opt
write_json ./output/test2.json
show