read_verilog test10_memory_multiport.v
read_verilog -lib ../v2flib/v2f_primitives.v
hierarchy -libdir ../v2flib -check -top top

#coarse
proc
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt
wreduce
peepopt
opt_clean
booth
share
opt

opt_mem_priority
opt_mem_feedback
memory_bmux2rom
memory_dff
opt_clean
memory_share
opt_mem_widen
memory_memx
opt_clean
memory_collect

#fine
opt -fast -full
#memory_libmap -lib ../v2flib/v2f_memory.lib

script ../v2flib/techmap.ys

#final
write_json -selected ./output/test10.json
show top