read_verilog test8_memory.v
hierarchy -libdir ../v2flib -check -top top

#coarse
proc
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt
wreduce
peepopt
opt_clean
booth
share
opt

opt_mem_priority
opt_mem_feedback
memory_bmux2rom
memory_dff
opt_clean
memory_share
opt_mem_widen
memory_memx
opt_clean
memory_collect

memory_libmap -lib ../v2flib/v2f_memory.lib

#fine
opt -fast -full
techmap \
	-dont_map $shl -dont_map $shr \
	-dont_map $mul -dont_map $div \
	-dont_map $mod -dont_map $pow \
	-dont_map $add -dont_map $sub \
	-dont_map $sdff
techmap -map ../yosys/techlibs/common/gate2lut.v -D LUT_WIDTH 8
clean; opt_lut
flowmap -maxlut 8
opt -fast
abc -fast
abc -fast -lut 8
opt -fast

#final
write_json ./output/test8.json
show top