
read_verilog balancer.v
read_verilog -lib ../v2flib/v2f_primitives.v
hierarchy -check -libdir ../v2flib -top top
proc
flatten
opt
script ../v2flib/techmap.ys
write_json -selected ./output/test4.json
show top