read_verilog memory.v
hierarchy -libdir ../v2flib -check -top top

#coarse
proc
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt
wreduce
peepopt
opt_clean
booth
share
opt
memory -nomap
opt_clean

memory_libmap -lib my_memory_map.txt
techmap -map my_memory_map.v
memory_map

#fine
opt -fast -full
memory_map
opt -full
techmap \
	-dont_map $shl -dont_map $shr \
	-dont_map $mul -dont_map $div \
	-dont_map $mod -dont_map $pow \
	-dont_map $add -dont_map $sub \
	-dont_map $sdff
techmap -map ../yosys/techlibs/common/gate2lut.v -D LUT_WIDTH 8
clean; opt_lut
flowmap -maxlut 8
opt -fast
abc -fast
abc -fast -lut 8
opt -fast

#final
write_json ./output/test7.json
show top