
read_verilog test3.v
hierarchy -check -top top
flatten
proc
opt
techmap -map ../yosys/techlibs/common/gate2lut.v -D LUT_WIDTH=8
opt
write_json ./output/test3.json
show