
read_verilog test3.v
read_verilog -lib ../v2flib/v2f_primitives.v
hierarchy -check -libdir ../v2flib -top top
flatten
proc
opt
script ../v2flib/techmap.ys
write_json -selected ./output/test3.json
show